_author_='Andrey Korolev'

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = int(input('Enter any number for variable "a": '))
b = int(input('Enter any number for variable "b": '))
c = a + b
print(c - a)
print(c - b)

