_author_='Andrey Korolev'

# Напишите скрипт, отображающий папки текущей директории.

import os
z = os.listdir()
print(z)
